glcloud/keil_v5/ARM/PACK/.Web/NXP.MKL26Z4_DFP.pdsc
    <condition id="device.MKL26Z4_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpsci"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.MKL26Z4_device.device_device_driver.dma_driver.dmamux">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKL26Z4_driver.common_driver.dmamux">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
    </condition>
    <condition id="device.MKL26Z4_driver.common">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKL26Z4_driver.flash">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MKL26Z4">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MKL26Z4_platform.Include_core_cm0plus">
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MKL26Z128xxx4_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
    </condition>
    <condition id="devices.MKL26Z256xxx4_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
    </condition>
    <condition id="devices.MKL26Z128xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z128???4"/>
    </condition>
    <condition id="devices.MKL26Z256xxx4_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MKL26Z256???4"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MKL26Z4_platform.Include_core_cm0plus">
      <description></description>
      <files>
        <file name="arm/startup_MKL26Z4.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MKL26Z4.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MKL26Z4.h" category="header" attr="config"/>
        <file name="MKL26Z4_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MKL26Z128xxx4_flash.scf" category="linkerScript" condition="devices.MKL26Z128xxx4_mdk" attr="config"/>
        <file name="arm/MKL26Z128xxx4_ram.scf" category="linkerScript" condition="devices.MKL26Z128xxx4_mdk" attr="config"/>
        <file name="arm/MKL26Z256xxx4_flash.scf" category="linkerScript" condition="devices.MKL26Z256xxx4_mdk" attr="config"/>
        <file name="arm/MKL26Z256xxx4_ram.scf" category="linkerScript" condition="devices.MKL26Z256xxx4_mdk" attr="config"/>
        <file name="iar/MKL26Z128xxx4_flash.icf" category="linkerScript" condition="devices.MKL26Z128xxx4_iar" attr="config"/>
        <file name="iar/MKL26Z128xxx4_ram.icf" category="linkerScript" condition="devices.MKL26Z128xxx4_iar" attr="config"/>
        <file name="iar/MKL26Z256xxx4_flash.icf" category="linkerScript" condition="devices.MKL26Z256xxx4_iar" attr="config"/>
        <file name="iar/MKL26Z256xxx4_ram.icf" category="linkerScript" condition="devices.MKL26Z256xxx4_iar" attr="config"/>
        <file name="system_MKL26Z4.c" category="sourceC" attr="config"/>
        <file name="system_MKL26Z4.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MKL26Z4" isDefaultVariant="1" condition="devices.MKL26Z4_device.MKL26Z4_device.MKL26Z4_startup_driver.clock_driver.common_driver.gpio_driver.lpsci_driver.port_driver.smc_driver.uart_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.1" Csub="i2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MKL26Z4_driver.i2c">
      <description>I2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_i2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_i2c_cmsis.h" category="header"/>
      </files>
    </component>
